/* Методи Масивів  */


/*

1. Дано два масиви - [1, 2, 3], [4, 5, 6] . Об'єднайте ці два масиви

2. Даний масив [1, 2, 3]. Зробіть з нього масив [3, 2, 1]

3. Даний масив [1, 2, 3]. Додайте йому в кінець 4, 5, 6

4. Даний масив [1, 2, 3]. Додайте йому на початок 6, 7, 8

///

5. Даний масив ['aaa', 'bbb', 'ccc']. Виведіть на екран останній елемент і видаліть його 

6. Даний масив ['ddd', 'eee', 'ccc']. Виведіть перший елемент і видаліть його

7. Даний масив [1, 2, 3, 4, 5, 6]. Не змінюючи його, створіть новий з елементами з третього по п'ятий включно

8. З масиву [1, 2, 3, 4, 5] зробіть масив [4, 5].

9. З масиву [1, 2, 3, 4, 5] зробіть новий масив [2, 3, 4]

10. За допомогою методу splice з масива [1, 2, 3, 4, 5] зробити масив [1, 'w, 'tr', 2, 3, 4, 'vv', 5, 'a']
(не одним рядком коду)))


*/