/* Цикли  */


/// Цикл - це повторення певного блоку коду задану кількість разів
// Одне повторення (захід виконання) наз. ітерація

/*
while(умова) {
    // блок коду, який буде виконуватись, поки умова = true
    // коли умова = false, ми виходимо з циклу
}
*/

debugger;

let counter = 0;

while(++counter < 3) {
    console.log('loop is going');
}

console.log('loop has ended');

/* 
Префіксна форма інкремента - спочатку +1, потім працюємо зі значенням (порівнюємо його, наприклад, з умовою)
постфіксна форма - спочатку працюємо зі значенням, потім +1


*/