alert('Hello, user'); // Модальне вікно, що сповіщує користувача (є тільки кнопка "Ок")
let result = confirm('Are you ready to go?'); // Модальне вікно, яке запитує щось у користувача. Якщо користувач обрав "Ок" (погодився), то результатом роботи функції буде true, якщо користувач натисне "Cancel", то результатом буде false
console.log(result);

let name = prompt('Type your name, please'); // Модальне вікно, яке дозволяє користувачу щось ввести в поле вводу. Повертає в якості результату роботи те, що користувач ввів в інпут.
console.log(name);