/* Цикли  */

/*
Домашнє завдання

1. Реализувати гру FizzBuzz
https://ru.wikipedia.org/wiki/Fizz_buzz
Вивести числа від 1 до 100
Якщо число ділиться на 3, то замість числа вивести "Fizz"
Якщо число ділиться на 5, то замість числа вивести "Buzz"
число ділиться і на 3, і на 5, то замість числа вивести "FizzBuzz"

2. Написати функцію, яка грає з користувачем в "угадайку".
Ви загадуєте якесь число і змушуєте користувача його відгадати - вводити його варіанти в prompt.
Якщо його число більше, ніж те що ви загадали, то вивести alert("забагато"), навпаки - вивести "замало".
Повторювати дію, поки користувач не введе правильне число.

*/