/*
Практика:

1. Створіть дві змінні - a та b. Присвойте їм довільні числа. Виведіть в консоль результат їхнього множення

2. Створіть змінні d та e. Присвойте одній число, іншій рядок. Виведіть в консоль результат їхнього складання. 
Який тип даних буде у результату операції? Чому?

3. Переробіть наведений нижче код, використовуючи скорочений вигляд операторів з присвоюванням та операторів інкременту/декременту
( +=, -=, *=, /= ):

let num = 1;
num = num - 1;
num = num + 1;
num = num + 11;
num = num * 11;
num = num / 11;
num = num - 11;


*/

//1

let a = 1;
let b = 2;

console.log(a*b);

//2

let d = 1;
let e = '2';
console.log(d+e);


//3
let num = 1;
num--;
num++;
num += 11;
num *= 11;
num /= 11;
num -= 11;