/* Таска на парні дужки 


(2+2)+[2*(2/4)+3] - правильно розставлені

(3+[4)}+() - неправильно розставлені

()[{<>}] - правильно
)[}( - неправильно

Завдання: написати функцію, яка реалізує перевірку правильності дужок у рядку
Перший (базовий) рівень завдання - аналізувати рядок, який складається тільки з дужок
Завдання з *: щоб ваша функція могла прийняти рядок з дужками, числами, літерами і аналізувала тільки дужки


Результат роботи функції:
 true, якщо парність правильна
 false, якщо порядок відкритих-закритих парних дужок неправильний

Для вирішення задачі використувати стек.

*/


/*
Декомпозиція задачі:

1. Перебираємо символи нашого рядка поштучно.
2. Аналізуємо символ, який ми зустріли.
Якщо це "відкриваюча" дужка - додати її до стеку
Якщо перед нами дужка, яка закривається - вона "анігілює" парну їй дужку в стеку
3. Якщо ми дійшли до кінця - аналізуємо, чи щось ще залишилось незакритим

*/