/* Приведення типів */

/*
+: Якщо два операнди - числа, складає їх арифметично, як числа
Якщо хоч один операнд - це рядок, то всі операнди приводяться до рядка і + конкатенує рядки
Якщо операнд - булеанівський тип (true/false), то + приведе їх до числа

null == 0


число + undefined == NaN
*/
let res = 2 + (4 + '4');

console.log(res);


// boolean - true (істина, правда) - false (неправда)
// true == 1
// false == 0

let num = 2 + true;

console.log(num);


/*

3 + undefined
//NaN
"" + undefined
//'undefined'
"" + true
//'true'
22 + ""
//'22'
22 + " "
//'22 '

*/



// -, *, /, % (аріфметичні оператори окрім "+")
// приводять операнди до чисел

/*
5 - true
//4
5 * false
//0
5 * '5' - привів рядок до числа і перемножив
//25
5 * '5a' - намагався привести, але отримав не-число
//NaN




*/