/*
Вивести користувачу "меню" з трьох напоїв і прийняти його вибір
1 - Чай
2 - Кава
3 - Сік

Якщо користувач напише 1 - вивести "Ви обрали чай"
Якщо 2 - "Ви обрали каву"
Якщо 3 - "Ви обрали сік"

Якщо якийсь інший варіант - написати "Я не знаю такого напою"

*/
//debugger;

//let userInput = prompt('Оберіть напій \n 1 - Чай \n2 - Кава \n3 - Сік');

// if(userInput === '1') {
//     console.log("Ви обрали чай");
// } else if (userInput === '2') {
//     console.log("Ви обрали каву");
// } else if(userInput === '3') {
//     console.log("Ви обрали сік");
// } else {
//     console.log('Я не знаю такого напою')
// }


/*
Switch - Це оператор вітвлення

case - випадок

switch(змінна) {// змінна чи будь-яке значення, яке буде "вмикати" потрібний варіант 
    case значення1:
        // робимо щось, якщо змінна = значення1
    case значення2:
        //робимо щось, якщо змінна = значення2
    case значення3:
            // робимо щось, якщо змінна = значення3
    case значення4:
            //робимо щось, якщо змінна = значення4
    default:
        // робимо щось, якщо ніхто з попередніх варіантів не підійшов
}

*/

debugger

let x = 2;


switch(x) {
    case 1: {
        console.log('x=1');
        break;
    }
    case 2: {
        console.log('x=2');
        break;
    }
    case 3: {
        console.log('x=3');
        break;
    }
    default:
        console.log('x??');
}


//break - оператор, що зупиняє виконання поточного блоку коду


