/*
Домашнє завдання:


1. Написати функцію, яка приймає число і виводить результат обчислення множення 2 на 1...до цього числа
Цикл та шаблонний рядок


2. Написати функцію getBanned(), яка приймає об'єкт юзера і додає йому нову властивість - banned = true.
В результаті повернути true.
Задача на роботу з об'єктами.
В якості перевірки зробіть декілька об'єктів юзерів і послідовно їх "забаньте".
*/


function getTwoMultyNumber(num) {

}


getTwoMultyNumber(5) 
// 2*1 = 2
// 2*2 = 4
// 2*3 = 6
// 2*4 = 8
// 2*5 = 10